app/views/authors/index.html.erb

        <td><%= author.last_name.capitalize %></td>
        <td><%= author.books.count %></td>
---
SELECT "books".* FROM "books" WHERE "books"."author_id" IN (4, 3, 7, 5) ORDER BY title ASC
SELECT COUNT(*) FROM "books" WHERE "books"."author_id" = $1  [["author_id", 4]]