app/views/authors/show.html.erb


<% if !@author.books.empty? %>
---
SELECT  1 AS one FROM "books" WHERE "books"."author_id" = $1 LIMIT $2  [["author_id", 1], ["LIMIT", 1]]
SELECT "books".* FROM "books" WHERE "books"."author_id" = $1 ORDER BY title ASC  [["author_id", 7]]