app/controllers/authors_controller.rb

SELECT "authors".* FROM "authors" ORDER BY "authors"."last_name" ASC, "authors"."first_name" ASC
SELECT "books".* FROM "books" WHERE "books"."author_id" IN (4, 3, 5) ORDER BY title ASC
---
  def index
    @authors = Author.includes(:books).order(:last_name, :first_name)

INSERT INTO "authors" ("first_name", "last_name", "created_at", "updated_at") VALUES ($1, $2, $3, $4) RETURNING "id"  [["first_name", "Stephen"], ["last_name", "King"], ["created_at", "2017-06-25 12:35:33.034543"], ["updated_at", "2017-06-25 12:35:33.034543"]]
---
  def create
    @author = Author.new(author_params)

    respond_to do |format|
      if @author.save

UPDATE "authors" SET "first_name" = $1, "last_name" = $2, "updated_at" = $3 WHERE "authors"."id" = $4  [["first_name", "90zdUpclKxblsfpVQdQmBrdOzppO7KTsmwxx"], ["last_name", "nttCGmA5LFUT38omfZsMa53FTFUbrn2WYgxx"], ["updated_at", "2017-06-25 12:48:09.932358"], ["id", 980190973]]
---
  def update
    respond_to do |format|
      if @author.update(author_params)